## Baseball Hall of Fame

### Before we get started, you'll need to follow the below steps to create the players_db database and create the tables:
1. Open **PostgreSQL** (You may be asked to enter your password. Please enter your password.)
2. Right click on **Databases**, select **Create** and then **Database**.
3. Enter **players_db** as the database name and click **Save**.
4. Select the players_db database to make the connection active.
5. Right click on players_db and select **Query Tool**.
6. Open the **schema.sql** file found in the *Resources* folder.
7. Run the queries to create the two tables (players and hall_of_fame).
8. Make sure your **config.py** file is updated with your username and password.

In [6]:
#import dependencies
import pandas as pd
from sqlalchemy import create_engine
from config import username, password

ModuleNotFoundError: No module named 'config'

### Where did we find our data?

We found our two CSV files on Kraggle:

players: https://www.kaggle.com/seanlahman/the-history-of-baseball?select=player.csv \
hall of fame: https://www.kaggle.com/seanlahman/the-history-of-baseball?select=hall_of_fame.csv

### Extract CSVs into DataFrame

In [7]:
# extract players CSV into dataframe

csv_file = "Resources/player.csv"
player_data_df = pd.read_csv(csv_file)
player_data_df.head()

,player_id,birth_year,birth_month,birth_day,birth_country,birth_state,birth_city,death_year,death_month,death_day,...,name_last,name_given,weight,height,bats,throws,debut,final_game,retro_id,bbref_id
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,220.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [8]:
# extract hall of fame CSV into dataframe

csv_file = "Resources/hall_of_fame.csv"
hof_data_df = pd.read_csv(csv_file)
hof_data_df.head()

,player_id,yearid,votedby,ballots,needed,votes,inducted,category,needed_note
0,cobbty01,1936,BBWAA,226.0,170.0,222.0,Y,Player,NaN
1,ruthba01,1936,BBWAA,226.0,170.0,215.0,Y,Player,NaN
2,wagneho01,1936,BBWAA,226.0,170.0,215.0,Y,Player,NaN
3,mathech01,1936,BBWAA,226.0,170.0,205.0,Y,Player,NaN
4,johnswa01,1936,BBWAA,226.0,170.0,189.0,Y,Player,NaN

### Extraction Process:
- Downloaded CSV files from Kraggle
- Extracted both CSV files into two separate dataframes

### Transform player DataFrame

In [17]:
transformed_player = player_data_df[["player_id","name_first","name_last","birth_country","debut","final_game"]]

transformed_player

       player_id name_first name_last birth_country       debut  final_game
0      aardsda01      David   Aardsma           USA  2004-04-06  2015-08-23
1      aaronha01       Hank     Aaron           USA  1954-04-13  1976-10-03
2      aaronto01     Tommie     Aaron           USA  1962-04-10  1971-09-26
3       aasedo01        Don      Aase           USA  1977-07-26  1990-10-03
4       abadan01       Andy      Abad           USA  2001-09-10  2006-04-13
...          ...        ...       ...           ...         ...         ...
18841   zupofr01      Frank      Zupo           USA  1957-07-01  1961-05-09
18842  zuvelpa01       Paul   Zuvella           USA  1982-09-04  1991-05-02
18843  zuverge01     George  Zuverink           USA  1951-04-21  1959-06-15
18844  zwilldu01      Dutch  Zwilling           USA  1910-08-14  1916-07-12
18845   zychto01       Tony      Zych           USA  2015-09-04  2015-10-03

[18846 rows x 6 columns]

### Transform hall of fame DataFrame

In [18]:
    transformed_HOF = hof_data_df[hof_data_df['inducted'] =='Y']
    transformed_HOF = transformed_HOF.drop(['votedby','ballots','needed','votes','category','needed_note'],axis=1)
    transformed_HOF

      player_id  yearid inducted
0      cobbty01    1936        Y
1      ruthba01    1936        Y
2     wagneho01    1936        Y
3     mathech01    1936        Y
4     johnswa01    1936        Y
...         ...     ...      ...
4055  martipe02    2015        Y
4056  smoltjo01    2015        Y
4057  biggicr01    2015        Y
4088  griffke02    2016        Y
4089  piazzmi01    2016        Y

[312 rows x 3 columns]

### Transformation Process:
- Established player_id as the primary key for both datasets
- Removed unncessary columns from both datasets

### Create database connection

In [20]:
connection_string = "<username>:<password>@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{connection_string}')

NameError: name 'username' is not defined

### Check for tables

In [8]:
# Confirm tables
engine.table_names("Players","Hall_of_fame")

NameError: name 'engine' is not defined

### Load DataFrames into database

In [ ]:
transformed_player.to_sql(name='players', con=engine, if_exists='append', index=True)

In [ ]:
transformed_HOF.to_sql(name='hall_of_fame', con=engine, if_exists='append', index=True)

### Confirm data has been added by querying the players table

In [ ]:
pd.read_sql_query('select * from players', con=engine).head()

### Confirm data has been added by querying the hall of fame table

In [ ]:
pd.read_sql_query('select * from hall_of_fame', con=engine).head()

### Load Process:
- Created a connection to PostgreSQL
- Confirmed the table names already exist
- Loaded each dataframe separately to its appropriate table
- Ran two simple queries to confirm both dataframes loaded into the database as expected

### Why did we choose PostgreSQL?

We chose PostgreSQL because we were most comfortable utilizing this sort of database as one of us has experience with SQLServer and the two are very similar. Also with data coming from multiple sources, using a relational database in order to join the two datasets together seemed like the best approach.

### Why did we choose baseball player and hall of fame data?

After looking through random collections on Kraggle, the baseball collection had the most data to choose from. We looked through many files to figure out which two datasets would compliment each other and landed on the Players and Hall of Fame datasets. They both had the same player_id field which would be beneficial when joining the tables together.